<!-- html部分 -->
<template>
	<div id="app">
		<h1>企业能耗比对比图 (曲线图)</h1>
		<ve-line :data="chartData"></ve-line>
		<ve-histogram :data='chartData'></ve-histogram>
	</div>
</template>
<!-- js部分 -->
<script>
	 export default {
    data: function () {
      return {
        chartData: {
          columns: ['月份', '周口', '上海', '杭州'],
          rows: [
            { '月份': '1', '周口': 14, '上海': 20, '杭州': 10 },
            { '月份': '2', '周口': 20, '上海': 17, '杭州': 15 },
            { '月份': '3', '周口': 21, '上海': 23, '杭州': 11 },
            { '月份': '4', '周口': 10, '上海': 26, '杭州': 21 },
            { '月份': '5', '周口': 15, '上海': 34, '杭州': 13},
            { '月份': '6', '周口': 23, '上海': 30, '杭州': 17 },
            { '月份': '7', '周口': 11, '上海': 28, '杭州': 23 },
            { '月份': '8', '周口': 26, '上海': 23, '杭州': 20 }
          ],
		  rows: [
		    { '月份': '1', '周口': 14, '上海': 20, '杭州': 10 },
		    { '月份': '2', '周口': 20, '上海': 17, '杭州': 15 },
		    { '月份': '3', '周口': 21, '上海': 23, '杭州': 11 },
		    { '月份': '4', '周口': 10, '上海': 26, '杭州': 21 },
		    { '月份': '5', '周口': 15, '上海': 34, '杭州': 13},
		    { '月份': '6', '周口': 23, '上海': 30, '杭州': 17 },
		    { '月份': '7', '周口': 11, '上海': 28, '杭州': 23 },
		    { '月份': '8', '周口': 26, '上海': 23, '杭州': 20 }
		  ],
        }
      }
			methods:{
				
			}
			mouted:{
				this.chartData = date;
			}
    }
  }
</script>
<!-- css部分 -->
<style>

</style>
